popoC/msp430/半圓形馬達控制板/main 10-16.cpp
//--2010/10/16 加入重開機時重設參數
//----2010/10/12 加入SD---------------------

//----2010/10/08 加入看門狗---------------------
// P2.6 P2.7 用來控制電子羅盤

//----2010/10/07 加入SD卡以及電子羅盤
//******************************************************************************
// ***** I/O **** .......4/19
// P1   *************************              
// P2.0     input   interrupt for set or start
// P2.1     input   interrupt for test mode
// P2.2~7   X       for nothing  
// P3.4~7   I/O     for RS232
//    P4.0 P4.1  開關RELAY     //----注意 PWM 可使用的腳位為 P4.1~7 
//    P4.2 3 4 5 可當PWM使用  ((目前板子上6 7 要換到 2 3腳)) 先寫 4 5兩PIN 
//    ch1  P4.4 P4.5    output  for motorA
//    ch2  P4.2 P4.3    output  for motorB
// P5.
//   P6.0  **無法使用 ...因為腳沒接出來((褐色板子
//---- AD 請使用 P6.1 開始             ((褐色板子
//******************************************************************************
#include  <msp430x16x.h>
#include <stdio.h>
#include "main.h"
#include "sdhc.h"
#include "spi.h"


#define abs(x)( (x) > 0 ? (x) : (-x))
#define CW  1
#define CCW 0
//------------------------------------------//------------------------------------------
//-----------for SD card format table-------------------------------------------
    int SDCARD_Init();      
    int read_SD_format(); 
   void do_storage(int);  
   void update_table();

   static unsigned long int blockaddress = 0;
                     int total;
                     u32 startblock, endblock;
    int check_SD_card = 1;                           
    int SdCardOpen=1;                
    
    int Save_Data = 0;
    
    unsigned long int Save_timeCount = 7200;  //每兩小時記錄一次時間
    unsigned long int countSD_saveTime = 0;
    unsigned  long int Now_X_Axis_1 = 0;
    unsigned  long int Now_Y_Axis_1 = 0;    
    unsigned  long int Now_X_Axis_2 = 0;
    unsigned  long int Now_Y_Axis_2 = 0;    
    unsigned  long int Now_X_Axis = 0;
    unsigned  long int Now_Y_Axis = 0;    

//---------------

  int delay1,delay2;
  
bool WDT_flag;


bool Leveling=false;
//---------------------------------------------


void MotoControl_Stop(int ch);
void MotoControl_Run(int ch,int cw_ccw);
void PwmSet();
void GoToRange_V2();
void GoHome();

void write_flash_segA();
void read_flash_segA();
//---------------UR----function-------------------------------------------------
   void Rs232_Init();             //---順便開啟高頻震盪器
   void UART1_SendByte(unsigned char data);
   void UART1_SendStr(char *str);
//--------------------------------------------------------------------
double Angle_X ;
double Angle_Y ;

int Hand_X_Time = 0,Hand_X_Dir=1,Hand_Y_Time=500,Hand_Y_Dir=0;

//static unsigned  long int outPut_Buf = 1620;
static unsigned int results[2];             // Needs to be global in this example
void AD_Init();
void DoTheAd(int avgtime,bool print);



int pow(int i,int j);
//------處理RS232輸入訊號及顯示用 
char command[255];  int coMMand_N = 0; int coMMand_Mode =0;  char string[255];
int GetInputVal(int G);
//--------------------------------
int Set_OriginX_flag = 0;
int Set_OriginY_flag = 0;




unsigned long int countTime = 0;
 int ControlMode = 1;             
 
 int AD_AVGtime = 1000;           
 int motor_T_AD = 10;             
 int Set_OriginX = 10;
 int Set_OriginY = 10;
 int move1deg_T = 10; 

          int frequency_pwm = 500;                
unsigned  int percent_pwm = 50; 
 int WantToAngle = 0;           
 int RunTime;

     //frequency_pwm
    // percent_pwm 
              int ReStart_Day = 7;                 // 7.
unsigned long int ReStart_Sec = 0;  // 8.
unsigned int FirstStart_Sec = 0;              //9.
int startCount = 1;

//-----------------------------------

bool FirstStart = true;
bool outPutcount = true;    
unsigned long int count_back = 0;


void OpenMotorPower();
void CloseMotorPower();

bool Setting_mode = true;



void all_restart(){

FirstStart = true;
outPutcount = true;
count_back = 0;
Setting_mode = true;

 ReStart_Day = 7;
 ReStart_Sec = 0;  
 FirstStart_Sec = 0;
 startCount = 1;
 
}

//------------------------------------------------------------------------------
void main(void)
{
 
  WDTCTL = WDTPW+WDTHOLD;                   // Stop watchdog timer
 
  sd_buffer1[1] = 'Y';
  sd_buffer1[2] = '5';
    
    
  FCTL2 = FWKEY + FSSEL0 + FN0;             // MCLK/2 for Flash Timing Generator

  read_flash_segA();

  
  Rs232_Init();                             //  RS232 初始化      115200   P3  
  
  P4DIR = 0xff;                             // Set P4. to output direction 
  P4OUT = 0;

  WDT_flag = true;
  TBCTL = TBSSEL_2 + MC_1;                  // SCLK, up-down mode  PWM timeClock
  
  AD_Init();
 
  WDTCTL = WDT_ARST_1000;                   //--開狗
  
  CloseMotorPower();                        //----開電測試系統  
  
     // TimerA 啟動讀秒
      TACCTL0 = CCIE;                             // CCR0 interrupt enabled
      TACCR0 = 16384-1;                           // for 0.5 Hz
      TACTL = TASSEL_1 + MC_1;                    // ACLK, contmode  

    //     _BIS_SR(GIE);    

     Setting_mode = true;
     long int cou_delay;     
     
     
    SdCardOpen = SDCARD_Init();   //--初始化SD卡
    if(read_SD_format()){return;}           // read SD card format 
     
     
     while(Setting_mode){                      //---- setting mode
     
               if(Set_OriginX_flag){
                Set_OriginX_flag = 0;
                OpenMotorPower();
                cou_delay = (long int)motor_T_AD * 1150; //       delay
                while(cou_delay > 0){ cou_delay--;}       
                DoTheAd(AD_AVGtime,1);  
                CloseMotorPower();
                Set_OriginX =  (int)(Angle_X*100);
                write_flash_segA();
              }
              if(Set_OriginY_flag){
                Set_OriginY_flag = 0;
                OpenMotorPower();
                cou_delay = (long int)motor_T_AD * 1150; //       delay
                while(cou_delay > 0){ cou_delay--;}       
                DoTheAd(AD_AVGtime,1);  
                CloseMotorPower();
                Set_OriginY =  (int)(Angle_Y*100);
                write_flash_segA();
              }

