popoC/msp430/半圓形馬達控制板/main 10-16.cpp
           _BIS_SR(LPM0_bits + GIE);    
     }
      
  IE2 &= ~URXIE1 ;                           // Disable USART1 RX interrupt
          ReStart_Sec +=  ((unsigned long int)ReStart_Day * 3600);  //--
 //         ReStart_Sec +=  ((unsigned long int)ReStart_Day * 60);  //--  每隔分鐘數
  PwmSet();
  
int testRun = 0;




  sd_buffer1[15] = Set_OriginX & 0xff;
  sd_buffer1[16] = ((Set_OriginX>>8) & 0xff);
  sd_buffer1[17] = Set_OriginY & 0xff;
  sd_buffer1[18] = ((Set_OriginY>>8) & 0xff);


   Leveling = true;
while(1)          //-------------- working mode
  {
                           
    if(Leveling){  

      WDTCTL = WDTPW+WDTHOLD;                       // Stop watchdog timer
       TACCTL0 &= ~CCIE;                             // close timer
       
       Leveling = false;
       outPutcount = false;
       
      

         testRun++;
           sprintf(string,"this is %02d time   \r\n",testRun); UART1_SendStr(string);
        
      OpenMotorPower();       //----開電  
      WDTCTL = WDTPW+WDTHOLD;                       // Stop watchdog timer
      
                long int cou = (long int)motor_T_AD * 1150; //    100Hz   delay
                while(cou > 0){       cou--;   }       
                
      GoToRange_V2();
      GoHome();
     
      Now_X_Axis_2 = Now_X_Axis;
      Now_Y_Axis_2 = Now_Y_Axis;

      
      CloseMotorPower();      //----關電  
        outPutcount = true;
       
      
       if(Save_Data==2){
          Save_Data = 0;
          do_storage(2);
       WDTCTL = WDT_ARST_1000;             
          update_table();
       } 
       
       WDTCTL = WDT_ARST_1000;
        
        TACCTL0 |= CCIE;                             // open timer
    }

    
    if(Save_Data==1){
      Save_Data = 0;
      do_storage(1);
      update_table();
    }
      
    
    
    _BIS_SR(LPM0_bits + GIE);                 // Enter LPM0, Enable interrupts
 
    
    
      
  }
  
    
    
  
}

// Timer A0 interrupt service routine   //    if(DoAd) ADC12CTL0 |= ADC12SC;  // Start conversion

int divide = 0;
#pragma vector=TIMERA0_VECTOR
__interrupt void Timer_A (void)
{          //  **** ***** **** 1Hz
  
  if(WDT_flag)WDTCTL = WDT_ARST_1000;                            //--餵狗
 
  if(startCount){                                                //---暫停讀秒 功能
       divide++;        
       if(divide>1){
         countTime++; 
         divide=0;
         countSD_saveTime++;

       }      //-.-  一秒
  }
  
  if(outPutcount && (divide==1)){                                //每秒透過RS232輸出
    
      FirstStart ?count_back = FirstStart_Sec - countTime : count_back = ReStart_Sec - countTime ;
      sprintf(string,"%5ld s/ per%2d hours  SD:%2d , %c%c \r",count_back,ReStart_Day,check_SD_card,sd_buffer1[1],sd_buffer1[2]); 
//      sprintf(string,"%5d heading  /per %2d hours \r",TDCM3_Heading,TDCM3_status); 
      UART1_SendStr(string);
      
      _BIC_SR_IRQ(LPM0_bits);     
  }
  if( (countTime >= FirstStart_Sec ) && FirstStart){
           outPutcount = false;                //---做完第一次後就不用再輸出啦
             FirstStart = false;
             countTime = 0;
             Setting_mode = false;
             Leveling = true;
           _BIC_SR_IRQ(LPM0_bits);     
   }      

  if( countSD_saveTime>=Save_timeCount){
         countSD_saveTime = 0;
         Save_Data = 1;
       _BIC_SR_IRQ(LPM0_bits);   
  }
  if( (countTime >= ReStart_Sec) &&(!FirstStart)){
             Leveling = true;
             countTime = 0;
             Save_Data = 2;
         _BIC_SR_IRQ(LPM0_bits);   
   }

  
}

//------------------------------------------------------------------------------
void Rs232_Init(){
                            //------------P3------------------------------------
                            // P3.0(O) P3.1(I) P3.2(I) P3.3(I) P3.4(I) P3.5(I) P3.6(O) P3.7(I)
                            //   ↓      ↑      ↑      ↑      X       X       ↓      ↑
                            // SS(spi)  SIMO    SOMI    SCLK     t       r      TX      RX
                            //   └-------SDHC-----------┘       └Rs232-┘     └Rs232-┘
                            //------------P3------------------------------------
  P3SEL |= 0xC0;                       // P3.6,7 = USART1 TXD/RXD
  P3SEL |= 0x30;                       // P3.4,5 = USART0 TXD/RXD

//  P3DIR |= 0x30;                       // P3.4,P3.5, outputs
//  P3OUT |= BIT4;
//  P3OUT |= BIT5;
  
  
 volatile unsigned int i;  
  BCSCTL1 &= ~XT2OFF;                       // XT2on
  do{
    IFG1 &= ~OFIFG;                           // Clear OSCFault flag
    for (i = 0xFF; i > 0; i--);               // Time for flag to set
  }
  while ((IFG1 & OFIFG));                   // OSCFault flag still set?

  BCSCTL2 |= SELM_2 + SELS;                 // MCLK= SMCLK= XT2 (safe)
  
  ME2 |= UTXE1 + URXE1;                     // Enable USART1 TXD/RXD
  UCTL1 |= CHAR;                            // 8-bit character
  UTCTL1 |= SSEL1;                          // UCLK = SMCLK
  UBR01 = 0x45;                             // 8Mhz/115200 - 69.44
  UBR11 = 0x00;                             //
  UMCTL1 = 0x2C;                            // modulation
  UCTL1 &= ~SWRST;                          // Initialize USART state machine
  IE2 |= URXIE1 ;                           // Enable USART1 RX interrupt
  IFG2 &= ~UTXIFG1;                         // Clear inital flag on POR

  return;
}
void UART1_SendByte(unsigned char data)
{
        TXBUF1 = data;			          // 發送數據
}
void UART1_SendStr(char *str)
{
        while (*str != '\0')
        {
            UART1_SendByte(*str++);	          // 發送數據
            while (!(IFG2 & UTXIFG1));
        }
}
//------------------------------------------------------------------------------
int pow(int i,int j){
    int ans = 1;
    for(int k=0;k<j;k++)ans  = ans * i;
    return(ans);
}
//------------------------------------------------------------------------------
int GetInputVal(int G){
  if (G > 6)G=6;
      bool MnM = false;
        int coni = 0;     int ans = 0;
             for(int i=G-1;i>=0;i--){
               if(MnM){
                    ans += (command[i]-48) * pow(10,coni);
                    coni++;
                 }
                 if(command[i]==0x0D)MnM = true;
             }
             return(ans);
}
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
void read_flash_segA()
{
  char *Flash_ptr;                          // Flash pointer
  Flash_ptr = (char *) 0x1000;              // Initialize Flash pointer
  // SegA total 128    
  AD_AVGtime = 0;  motor_T_AD = 0;   Set_OriginX = 0;  move1deg_T = 0;
  percent_pwm = 0; frequency_pwm = 0; FirstStart_Sec = 0;Set_OriginY = 0;RunTime = 0;
  ReStart_Day = 0;

    AD_AVGtime += *Flash_ptr++;
    AD_AVGtime += (*Flash_ptr++)<<8;

    motor_T_AD += *Flash_ptr++;
    motor_T_AD += (*Flash_ptr++)<<8;

    Set_OriginX += *Flash_ptr++;
    Set_OriginX += (*Flash_ptr++)<<8;
    
