popoC/msp430/半圓形馬達控制板/main 10-16.cpp
    move1deg_T += *Flash_ptr++;
    move1deg_T += (*Flash_ptr++)<<8;
  
    frequency_pwm += *Flash_ptr++;
    frequency_pwm += (*Flash_ptr++)<<8;

    percent_pwm += *Flash_ptr++;
    percent_pwm += (*Flash_ptr++)<<8;
    
    FirstStart_Sec += *Flash_ptr++;
    FirstStart_Sec += (*Flash_ptr++)<<8;
    
    Set_OriginY += *Flash_ptr++;
    Set_OriginY += (*Flash_ptr++)<<8;
    
    RunTime += *Flash_ptr++;
    RunTime += (*Flash_ptr++)<<8;
      
    ReStart_Day += *Flash_ptr++;
    ReStart_Day += (*Flash_ptr++)<<8;
}
void write_flash_segA()
{
  char *Flash_ptr;                          // Flash pointer

  Flash_ptr = (char *) 0x1000;              // Initialize Flash pointer
  FCTL1 = FWKEY + ERASE;                    // Set Erase bit
  FCTL3 = FWKEY;                            // Clear Lock bit
 
  *Flash_ptr = 0;                           // Dummy write to erase Flash segment

  FCTL1 = FWKEY + WRT;                      // Set WRT bit for write operation
 
  *Flash_ptr++  =  (AD_AVGtime & 0x00ff);
  *Flash_ptr++  =  ((AD_AVGtime>>8)& 0x00ff) ;
  
  *Flash_ptr++  =  (motor_T_AD & 0x00ff);
  *Flash_ptr++  =  ((motor_T_AD>>8)& 0x00ff) ;
  
  *Flash_ptr++  =  (Set_OriginX & 0x00ff);
  *Flash_ptr++  =  ((Set_OriginX>>8)& 0x00ff) ;
  
  *Flash_ptr++  =  (move1deg_T & 0x00ff);
  *Flash_ptr++  =  ((move1deg_T>>8)& 0x00ff) ;

  *Flash_ptr++  =  (frequency_pwm & 0x00ff);
  *Flash_ptr++  =  ((frequency_pwm>>8)& 0x00ff) ;
  
  *Flash_ptr++  =  (percent_pwm & 0x00ff);
  *Flash_ptr++  =  ((percent_pwm>>8)& 0x00ff) ;

  *Flash_ptr++  =  (FirstStart_Sec & 0x00ff);
  *Flash_ptr++  =  ((FirstStart_Sec>>8)& 0x00ff) ;
  
  *Flash_ptr++  =  (Set_OriginY & 0x00ff);
  *Flash_ptr++  =  ((Set_OriginY>>8)& 0x00ff) ;
  
  *Flash_ptr++  =  (RunTime & 0x00ff);
  *Flash_ptr++  =  ((RunTime>>8)& 0x00ff) ;
  
  *Flash_ptr++  =  (ReStart_Day & 0x00ff);
  *Flash_ptr++  =  ((ReStart_Day>>8)& 0x00ff) ;

 
  
  FCTL1 = FWKEY;                            // Clear WRT bit
  FCTL3 = FWKEY + LOCK;                     // Set LOCK bit
}

//-----------------------------------------------------------------------------
void DoTheAd(int avgtime,bool print){
  unsigned  long int outPutX = 0;
  unsigned  long int outPutY = 0;
  
   for(int y=0;y<avgtime;y++)
   {
      ADC12CTL0 |= ADC12SC;                     // Start conversion
      while ((ADC12IFG & BIT2)==0);             //---
      //      _BIS_SR(LPM0_bits + GIE); 
       results[0] = ADC12MEM1;                   // Move results, IFG is cleared
       results[1] = ADC12MEM2;                   // Move results, IFG is cleared
      
      outPutX += results[0];
      outPutY += results[1];
   }
     outPutX = outPutX /avgtime;
     outPutY = outPutY /avgtime;
     
     Angle_X = (20 * ( (double)outPutX / 4096)) - 10 - ((double)Set_OriginX*0.01);
     Angle_Y = (20 * ( (double)outPutY / 4096)) - 10 - ((double)Set_OriginY*0.01);
    

     Now_X_Axis = outPutX;
     Now_Y_Axis = outPutY;
     
     
     
     if(print){ sprintf(string," the X angle = %2.6f    Y = %2.6f  ",Angle_X,Angle_Y); UART1_SendStr(string);
      sprintf(string," the X AD    = %05d     Y = %05d  \r\n",(int)outPutX,(int)outPutY); UART1_SendStr(string);
     }
}


void AD_Init(){
  P6SEL = 0x06;                             // Enable A/D channel inputs
  ADC12CTL0 = ADC12ON+MSC+SHT0_2;           // Turn on ADC12, set sampling time
  ADC12CTL1 = SHP+CONSEQ_1+SSEL1;                 // Use sampling timer, single sequence
  ADC12MCTL1 = INCH_1;                           // ref+=AVcc, channel = A1         ((P6.1
  ADC12MCTL2 = INCH_2+EOS;                       // ref+=AVcc, channel = A2 end seq.((P6.2
  ADC12CTL0 |= ENC;                            // Enable conversions
}
//------------------------------------------------------------------------------
void CloseMotorPower(){ 
    WDT_flag=false;
    WDTCTL = WDT_ARST_1000;
  
   P4OUT |= BIT1;
//    for(long int i=0;i<59600;i++){}
   for(long int i=0;i<8000;i++){}   //---10ms
   P4OUT &= ~(BIT1);

    WDT_flag=true;
    WDTCTL = WDT_ARST_1000;
   
}
void OpenMotorPower(){  
    WDT_flag=false;
    WDTCTL = WDT_ARST_1000;
   
    P4OUT |= BIT0;
//     for(long int i=0;i<59600;i++){}
    for(long int i=0;i<8000;i++){}
    P4OUT &= ~(BIT0);

    WDT_flag=true;
    WDTCTL = WDT_ARST_1000;
//    long int cou = (long int)motor_T_AD * 1150; //    100Hz   delay
//    while(cou > 0){       cou--;   }     
}
//----------------------------------------------------功能修改~ 2010/04/17
void GoHome(){

   long int cou = (long int)motor_T_AD * 1150; //    100Hz   delay
   while(cou > 0){       cou--;   }      
   DoTheAd(AD_AVGtime,1);  
   
   double Ang_Buf_X, Ang_Buf_Y;   
   double MoveTime_X, MoveTime_Y;      MoveTime_X = move1deg_T;     MoveTime_Y = move1deg_T;

   long int couX = -1, couY=-1;
   bool closeX,closeY;  

   
   for(int hh=0;hh<RunTime;hh++){
     closeX = false;     closeY = false;
     
        Ang_Buf_X = Angle_X;
        Ang_Buf_Y = Angle_Y;
          
     if( ( (abs(Angle_X)) < 0.1) && ( (abs(Angle_Y)) < 0.1)  )break;
   
     if(( (abs(Angle_X)) >= 0.1) ){
        (Angle_X  < 0) ? MotoControl_Run(1,CW) : MotoControl_Run(1,CCW);
         couX = (long int)abs(MoveTime_X *1150); 
         
         sprintf(string," couX is %05ld \r\n",couX); UART1_SendStr(string);              
     }
     if(( (abs(Angle_Y)) >= 0.1) ){
        (Angle_Y  < 0) ? MotoControl_Run(2,CW) : MotoControl_Run(2,CCW);
         couY = (long int)abs(MoveTime_Y *1150); 
         sprintf(string," couY is %05ld \r\n",couY); UART1_SendStr(string);              
     }
     
        while(1){
          couX--; couY--;    
               if( (couX <0) && (!closeX)){closeX = true;  MotoControl_Stop(1);} 
               if( (couY <0) && (!closeY)){closeY = true;  MotoControl_Stop(2);}     
               if(closeX && closeY)break;
        }
     
        cou = (long int)motor_T_AD * 1150;   while(cou > 0){       cou--;   }      
        DoTheAd(AD_AVGtime,1);              
   
        if(Angle_X==Ang_Buf_X){MoveTime_X = move1deg_T;}
        else{    MoveTime_X =  (Angle_X * MoveTime_X) / (Angle_X - Ang_Buf_X); }
        if(Angle_Y==Ang_Buf_Y){MoveTime_Y = move1deg_T;}
        else{MoveTime_Y =  (Angle_Y * MoveTime_Y) / (Angle_Y - Ang_Buf_Y);}
       
        if(abs(MoveTime_X) > move1deg_T*5)MoveTime_X = move1deg_T;   //-- 發散了
        if(abs(MoveTime_Y) > move1deg_T*5)MoveTime_Y = move1deg_T;

        sprintf(string," MoveTime_X is %09f  MoveTime_Y is %09f \r\n",MoveTime_X,MoveTime_Y); UART1_SendStr(string);     
        sprintf(string," RunTime =  %d   \r\n",hh ); UART1_SendStr(string);     
   
