popoC/msp430/半圓形馬達控制板/main 10-16.cpp
   }
   
   sprintf(string," End X is %05f  End Y is %05f \r\n",Angle_X,Angle_Y); UART1_SendStr(string);     
   
   
}
//-------------------------------------------------------------------------------
void GoToRange_V2(){
    
  bool enter_range_X = false,enter_range_Y = false;  

 DoTheAd(AD_AVGtime,0);  

 Now_X_Axis_1 = Now_X_Axis;
 Now_Y_Axis_1 = Now_Y_Axis;
 
 (Angle_X  < 0) ? MotoControl_Run(1,CW) : MotoControl_Run(1,CCW);
 (Angle_Y  < 0) ? MotoControl_Run(2,CW) : MotoControl_Run(2,CCW);

 
  long int countTTT = 0;
 while(1){
 
   DoTheAd(AD_AVGtime,0);  
   countTTT++;
   if( ( (abs(Angle_X)) < 1) && !enter_range_X   ){
          enter_range_X = true;
          MotoControl_Stop(1);
          sprintf(string," X Into Range  = %32f \r\n",Angle_X); UART1_SendStr(string);
   }
   if( ( (abs(Angle_Y)) < 1) && !enter_range_Y   ){
          enter_range_Y = true;
          MotoControl_Stop(2);
          sprintf(string," Y Into Range  = %32f \r\n",Angle_Y); UART1_SendStr(string);  
   }

    if(enter_range_X && enter_range_Y )break;
    if(countTTT > 5000)break;
 }

      sprintf(string,"  Run Time is  = %32ld \r\n",countTTT); UART1_SendStr(string);  
 
}
//-----------------------------------------------------------------------------------
void PwmSet(){
  TBCCR0 = 8000000/frequency_pwm;                           // PWM Period
    TBCCTL2 = OUTMOD_7;                         //  reset/set
    TBCCR2 =   ((100-percent_pwm)* (8000000/frequency_pwm))/100; //  PWM duty cycle
    TBCCTL3 = OUTMOD_7;                         //  reset/set
    TBCCR3 =   ((100-percent_pwm)* (8000000/frequency_pwm))/100; //  PWM duty cycle
    TBCCTL4 = OUTMOD_7;                         //  reset/set
    TBCCR4 =   ((100-percent_pwm)* (8000000/frequency_pwm))/100; //  PWM duty cycle
    TBCCTL5 = OUTMOD_7;                         //  reset/set
    TBCCR5 =   ((100-percent_pwm)* (8000000/frequency_pwm))/100; //  PWM duty cycle
}

void MotoControl_Run(int ch,int cw_ccw){
  switch(ch){
  case 1:
    if(cw_ccw==CW){P4SEL |= BIT2; P4OUT |=BIT3;}
    else          {P4SEL |= BIT3; P4OUT |=BIT2;}
    break;  
  case 2:
    if(cw_ccw==CW){P4SEL |= BIT4; P4OUT |=BIT5;}
    else          {P4SEL |= BIT5; P4OUT |=BIT4;}
    break;
  }
}
void MotoControl_Stop(int ch){
  switch(ch){
  case 1:
    P4SEL &= ~(BIT2+BIT3);
    P4OUT &= ~(BIT2+BIT3);
    break;  
  case 2:
    P4SEL &= ~(BIT4+BIT5);
    P4OUT &= ~(BIT4+BIT5);
    break;
  }
}

//------------------------------------------------------------------
//-------------------------中斷-------------------------------------------------
#pragma vector=UART1RX_VECTOR
__interrupt void usart1_rx (void)
{
       command[coMMand_N] = RXBUF1;
       coMMand_N++;

       if(command[coMMand_N-1]==0x1B){      //  ESC
         coMMand_Mode = 0;          coMMand_N = 0;
         return;
       }
       if (command[coMMand_N-1]==0x0D){     // Enter
           switch(coMMand_Mode){
           case 0:
               if(command[0] == 'k'){ 

                 coMMand_Mode = 99;
            //    string[0] = '\r' ;string[1] = '\n' ;  
            sprintf(string,"please select the function \r\n");                  UART1_SendStr(string);
            sprintf(string," ------V3.12------\r\n");                                UART1_SendStr(string);
            sprintf(string,"1. 控制模式((手動=0 自動回歸原點=1 %04d \r\n",ControlMode);       UART1_SendStr(string);
            sprintf(string,"2. 角度AD平均次數 = %04d \r\n",AD_AVGtime);            UART1_SendStr(string);
            sprintf(string,"3. 馬達轉動後讀取AD之延遲時間 = %04d \r\n",motor_T_AD);             UART1_SendStr(string);
            sprintf(string,"4. 原點_X = %04d \r\n",Set_OriginX);           UART1_SendStr(string);
            sprintf(string,"5. 原點_Y= %04d \r\n",Set_OriginY);            UART1_SendStr(string);
            sprintf(string,"6. 移動1度所需時間(請依據馬達特性修改 = %04d  \r\n",move1deg_T);            UART1_SendStr(string);
            sprintf(string,"7. pwm_頻率 = %06d \r\n",frequency_pwm);       UART1_SendStr(string);
            sprintf(string,"8. pwm_百分比 = %05d (0~100) \r\n",percent_pwm);   UART1_SendStr(string);
            sprintf(string,"9. 自動找尋原點次數 = %05d (0~5000) \r\n",RunTime);        UART1_SendStr(string);
            sprintf(string,"a. 手動控制 移動X軸時間 = %05d (0~65000) \r\n",Hand_X_Time);UART1_SendStr(string);
            sprintf(string,"b. 手動控制 移動X軸方向 = %05d (0~65000) \r\n",Hand_X_Dir); UART1_SendStr(string);
            sprintf(string,"w. 手動控制 移動Y軸時間 = %05d (0~65000) \r\n",Hand_Y_Time);UART1_SendStr(string);
            sprintf(string,"d. 手動控制 移動Y軸方向 = %05d (0~65000) \r\n",Hand_Y_Dir); UART1_SendStr(string);

            sprintf(string,"e. 第一次啟動時間 = %05d (0~65000) 秒\r\n",FirstStart_Sec);UART1_SendStr(string);
            sprintf(string,"f. 每隔%02d小時重新啟動                \r\n",ReStart_Day); UART1_SendStr(string);
            sprintf(string,"g. 倒數暫停 (0暫停 1繼續 ) \r\n");UART1_SendStr(string);

            sprintf(string," --------------------\r\n");         UART1_SendStr(string);
               }  
             
               break;
           case 99:
             
                coMMand_Mode  =  command[0];
              switch(coMMand_Mode){
               case '1':             
                    sprintf(string," ControlMode  = (預設為1");       UART1_SendStr(string);
                break;
               case '2':
                    sprintf(string," AD_AVGtime    =   ");             UART1_SendStr(string);
                break;
               case '3':
                    sprintf(string," motor_T_AD =   ");             UART1_SendStr(string);
                break;
               case '4':
                    sprintf(string," Set_OriginX=   ");             UART1_SendStr(string);
                break;
               case '5':
                    sprintf(string," Set_OriginY =   ");        UART1_SendStr(string);
                break;
               case '6':
                    sprintf(string," move1deg_T =   ");        UART1_SendStr(string);
                break;
               case '7':
                    sprintf(string," frequency_pwm =   ");      UART1_SendStr(string);
                break;
               case '8':
                    sprintf(string," percent_pwm =   ");       UART1_SendStr(string);
                break;
               case '9':
                    sprintf(string," RunTime =   ");       UART1_SendStr(string);
                break;
               case 'a':
                    sprintf(string," Hand_X_Time =   ");       UART1_SendStr(string);
                break;
               case 'b':
                    sprintf(string," Hand_X_Dir =   ");       UART1_SendStr(string);
                break;
               case 'w':
                    sprintf(string," Hand_Y_Time =   ");       UART1_SendStr(string);
                break;
               case 'd':
                    sprintf(string," Hand_Y_Dir =   ");       UART1_SendStr(string);
                break;
               case 'e':
                    sprintf(string," FirstStart_Sec =   ");       UART1_SendStr(string);
                break;
               case 'f':
                    sprintf(string," ReStart_Day =   ");       UART1_SendStr(string);
                break;
               case 'g':
                    sprintf(string," 0 oR 1 =   ");       UART1_SendStr(string);
                break;
                
