popoC/msp430/半圓形馬達控制板/main 10-16.cpp
              }
              break;
           case '1':
              ControlMode =GetInputVal(coMMand_N);
              break;
           case '2':
              AD_AVGtime = GetInputVal(coMMand_N);              write_flash_segA();
             break;
           case '3':
              motor_T_AD = GetInputVal(coMMand_N);              write_flash_segA();
             break;
           case '4':
              Set_OriginX = GetInputVal(coMMand_N);
              if(Set_OriginX !=0)Set_OriginX_flag = 1;        _BIC_SR_IRQ(LPM0_bits);                        
             break;
           case '5':
              Set_OriginY = GetInputVal(coMMand_N);
              if(Set_OriginY !=0)Set_OriginY_flag = 1;        _BIC_SR_IRQ(LPM0_bits); 
             break;
           case '6':
              move1deg_T = GetInputVal(coMMand_N);               write_flash_segA();              
             break;
           case '7':
             frequency_pwm = GetInputVal(coMMand_N);             write_flash_segA();  
             break;
           case '8':
             percent_pwm = GetInputVal(coMMand_N);               write_flash_segA();  
             break;
           case '9':
             RunTime = GetInputVal(coMMand_N);                   write_flash_segA();  
             break;             
           case 'a':
             Hand_X_Time = GetInputVal(coMMand_N);
             break;
           case 'b':
             Hand_X_Dir = GetInputVal(coMMand_N);
             break;
           case 'w':
             Hand_Y_Time = GetInputVal(coMMand_N);
             break;
           case 'd':
             Hand_Y_Dir = GetInputVal(coMMand_N);
             break;

           case 'e':
             FirstStart_Sec = GetInputVal(coMMand_N);            write_flash_segA();  
             break;
           case 'f':
             ReStart_Day = GetInputVal(coMMand_N);               write_flash_segA();   
             break;
           case 'g':
             startCount = GetInputVal(coMMand_N);
             break;
             
           }
           coMMand_N = 0;
       }

}
//-------------------------------------------------------------------------------------
//------------------------------------------------------------------------------
int do_sd_initialize (sd_context_t *sdc)
{
	spi_initialize();   // Initialize the SPI controller
	// Start out with a slow SPI clock, 400kHz, as required by the SD spec
	spi_set_divisor(PERIPH_CLOCKRATE/400000);
	// Initialization OK?
	if (sd_initialize(sdc) != 1)return 0;
	spi_set_divisor(2);return 1;  // Set the maximum SPI clock rate possible	
}
//------------------------------------------------------------------------------
void do_storage(int mode)
{
  
  if(mode==1)  {
             sd_buffer1[0] = 'D';
  }else{
             sd_buffer1[0] = 'M';
  }
  
  
             sd_buffer1[3] = countSD_saveTime & 0x00ff;
             sd_buffer1[4] = ((countSD_saveTime>>8) & 0x00ff);

             sd_buffer1[5] = Now_X_Axis_1 & 0x00ff;
             sd_buffer1[6] = ((Now_X_Axis_1>>8) & 0x00ff);

             sd_buffer1[7] = Now_Y_Axis_1 & 0x00ff;
             sd_buffer1[8] = ((Now_Y_Axis_1>>8) & 0x00ff);

             sd_buffer1[9] = Now_X_Axis_2 & 0x00ff;
             sd_buffer1[10] = ((Now_X_Axis_2>>8) & 0x00ff);

             sd_buffer1[11] = Now_Y_Axis_2 & 0x00ff;
             sd_buffer1[12] = ((Now_Y_Axis_2>>8) & 0x00ff);
  
             sd_buffer1[13] = countTime & 0x00ff;
             sd_buffer1[14] = ((countTime>>8) & 0x00ff);

             sd_buffer1[15] = Set_OriginX & 0x00ff;
             sd_buffer1[16] = ((Set_OriginX>>8) & 0x00ff);

             sd_buffer1[17] = Set_OriginY & 0x00ff;
             sd_buffer1[18] = ((Set_OriginY>>8) & 0x00ff);
             
             
             
             check_SD_card = sd_write_block(&sdc, blockaddress, sd_buffer1);
                   sd_wait_notbusy (&sdc);
         //     for(int i=0;i<512;i++)sd_buffer1[i]=0;

                   // 8G SD card limit -> 15660032 ~~ 15660000
                   // 16G               ->31388672 ~~ 31388600
                   // 32G               ->63078400 ~~
                                      
                  if( blockaddress >= 15660032)
                  {
                    //-do something for protect data
                    return ;
                  }
                  else{
                    blockaddress++;
                  }

}
//------------------------------------------------------------------------------
void update_table()
{
           endblock = blockaddress;
           sd_format_table[16*(total)+4] = (unsigned char)(endblock >> 24);
           sd_format_table[16*(total)+5] = (unsigned char)(endblock >> 16);
           sd_format_table[16*(total)+6] = (unsigned char)(endblock >> 8);
           sd_format_table[16*(total)+7] = (unsigned char)(endblock);
          check_SD_card = sd_write_block (&sdc, 0, sd_format_table);
           sd_wait_notbusy (&sdc);                  
}
//------------------------------------------------------------------------------
int read_SD_format(){
        // 讀取 format table
        sd_read_block(&sdc, 0, sd_format_table);
        sd_wait_notbusy (&sdc);
        // 讀取資料筆數
        total = sd_format_table[0];
        total = (total << 8) + sd_format_table[1];
        
        
       
        
        // 讀取最後一筆的 endblock
        startblock = sd_format_table[16*(total)+4];
        startblock = (startblock << 8 ) + sd_format_table[16*(total)+5];
        startblock = (startblock << 8 ) + sd_format_table[16*(total)+6];
        startblock = (startblock << 8 ) + sd_format_table[16*(total)+7];
        if(startblock<=100)startblock=100;
        // 寫入資料筆數
        total ++;
       
         if(total>31){
          total = 1;
        }
        
        sd_format_table[0] = total >> 8;
        sd_format_table[1] = total & 0xFF;  //  0x0F-> 0xFF------ 2010 10/06..... 錯誤修正
        // 設定目前的起始與結尾block
        startblock ++;
        blockaddress = startblock;
        endblock = startblock;
       
       
        
                                 //--翻頁
        
        sd_format_table[16*(total)+0] = (unsigned char)(startblock >> 24);
        sd_format_table[16*(total)+1] = (unsigned char)(startblock >> 16);
        sd_format_table[16*(total)+2] = (unsigned char)(startblock >> 8);
        sd_format_table[16*(total)+3] = (unsigned char)(startblock);
        sd_format_table[16*(total)+4] = (unsigned char)(endblock >> 24);
        sd_format_table[16*(total)+5] = (unsigned char)(endblock >> 16);
        sd_format_table[16*(total)+6] = (unsigned char)(endblock >> 8);
        sd_format_table[16*(total)+7] = (unsigned char)(endblock);

       check_SD_card = sd_write_block (&sdc, 0, sd_format_table);
        sd_wait_notbusy (&sdc);
        return 0;
}
//------------------------------------------------------------------------------
int SDCARD_Init(){
         int j, ok=0;
      // Set some reasonable values for the timeouts.
	sdc.timeout_write = PERIPH_CLOCKRATE/8;
	sdc.timeout_read = PERIPH_CLOCKRATE/20;
	sdc.busyflag = 0;
        for (j=0; j<SD_INIT_TRY && ok != 1; j++){
           ok = do_sd_initialize(&sdc);
        }
        if( ok != 1 ){ return 1;}
        else{
        return 2;            //----- SD CARD is on board;
        }
}
//------------------------------------------------------------------------------